
## Plan Result




<pre><code>Plan: 12 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.et_msg_handler_postgres_host_v15
  * azurerm_key_vault_secret.et_msg_handler_postgres_password_v15
  * azurerm_key_vault_secret.et_msg_handler_postgres_port_v15
  * azurerm_key_vault_secret.et_msg_handler_postgres_user_v15
  * module.postgres.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgres.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgres.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgres.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgres.azurerm_postgresql_flexible_server_database.pg_databases[&#34;et_msg_handler&#34;]
  * module.postgres.azurerm_resource_group.rg[0]
  * module.postgres.null_resource.set-user-permissions-additionaldbs[&#34;et_msg_handler&#34;]
  * module.postgres.random_password.password
* Update
  * module.db.azurerm_postgresql_server.postgres-paas
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.et_msg_handler_postgres_host_v15 will be created
  + resource "azurerm_key_vault_secret" "et_msg_handler_postgres_host_v15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-msg-handler-aat/providers/Microsoft.KeyVault/vaults/et-msg-handler-aat"
      + name                    = "et-msg-handler-postgres-host-v15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.et_msg_handler_postgres_password_v15 will be created
  + resource "azurerm_key_vault_secret" "et_msg_handler_postgres_password_v15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-msg-handler-aat/providers/Microsoft.KeyVault/vaults/et-msg-handler-aat"
      + name                    = "et-msg-handler-postgres-password-v15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.et_msg_handler_postgres_port_v15 will be created
  + resource "azurerm_key_vault_secret" "et_msg_handler_postgres_port_v15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-msg-handler-aat/providers/Microsoft.KeyVault/vaults/et-msg-handler-aat"
      + name                    = "et-msg-handler-postgres-port-v15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.et_msg_handler_postgres_user_v15 will be created
  + resource "azurerm_key_vault_secret" "et_msg_handler_postgres_user_v15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-msg-handler-aat/providers/Microsoft.KeyVault/vaults/et-msg-handler-aat"
      + name                    = "et-msg-handler-postgres-user-v15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.db.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-msg-handler-data-aat/providers/Microsoft.DBforPostgreSQL/servers/et-msg-handler-aat"
        name                              = "et-msg-handler-aat"
        tags                              = {
            "Team Contact"        = "#et-tech"
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "et-msg-handler"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "DTS Employment Tribunals"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }

        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-msg-handler-aat/providers/Microsoft.KeyVault/vaults/et-msg-handler-aat|et-msg-handler-aat"
        name                           = "et-msg-handler-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.postgres.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "et-msg-handler-postgres-v15-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "et-msg-handler-postgres-v15-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "Team Contact"        = "#et-tech"
          + "application"         = "employment-tribunals"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "et-msg-handler"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#et-developers"
          + "environment"         = "staging"
          + "managedBy"           = "DTS Employment Tribunals"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgres.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "et-msg-handler-postgres-v15-data-aat"
      + server_name         = "et-msg-handler-postgres-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgres.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "et-msg-handler-postgres-v15-data-aat"
      + server_name         = "et-msg-handler-postgres-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgres.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgres.azurerm_postgresql_flexible_server_database.pg_databases["et_msg_handler"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "et_msg_handler"
      + server_id = (known after apply)
    }

  # module.postgres.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "et-msg-handler-postgres-v15-data-aat"
      + tags     = {
          + "Team Contact"        = "#et-tech"
          + "application"         = "employment-tribunals"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "et-msg-handler"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#et-developers"
          + "environment"         = "staging"
          + "managedBy"           = "DTS Employment Tribunals"
        }
    }

  # module.postgres.null_resource.set-user-permissions-additionaldbs["et_msg_handler"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "name"           = "et-msg-handler-postgres-v15"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.postgres.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 12 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":276,"Program":"tfcmt","SHA1":"","Vars":{}} -->